#!/bin/bash
gcc -o 9_setuid 9_setuid.c -lcap
gcc -o 9_cap 9_cap.c -lcap

# Проверка, что компиляция прошла успешно
if [ $? -ne 0 ]; then
    echo "Ошибка компиляции программ"
    exit 1
fi

# Сброс возможностей файлов
echo "Сброс возможностей файлов"
sudo setcap -r ./9_setuid
sudo setcap -r ./9_cap

# Проверка возможностей после сброса
echo "Проверка возможностей после сброса"
getcap ./9_setuid
getcap ./9_cap

# Установка возможностей для 9_setuid
echo "Установка возможностей для 9_setuid"
sudo setcap cap_setuid=ep ./9_setuid

# Проверка возможностей после установки
echo "Проверка возможностей после установки"
getcap ./9_setuid

# Выполнение программы 9_setuid
echo "Выполнение 9_setuid с проверкой setuid:"
./9_setuid

# Установка возможностей для 9_cap
echo "Установка возможностей для 9_cap"
sudo setcap cap_setfcap=ep ./9_cap

# Проверка возможностей после установки
echo "Проверка возможностей после установки"
getcap ./9_cap

# Выполнение программы 9_cap для просмотра и установки возможностей
echo "Выполнение 9_cap для просмотра и установки возможностей:"
./9_cap ./9_setuid "cap_setuid=+ep"

# Проверка возможностей после выполнения 9_cap
echo "Возможности для 9_setuid после выполнения 9_cap:"
getcap ./9_setuid
echo "Возможности для 9_cap после выполнения 9_cap:"
getcap ./9_cap
